// - Користувач вводить або має два числа.
//     Потрібно знайти та вивести максимальне число з тих двох .
//     Також потрібно врахувати коли введені рівні числа.

// let x = +prompt('Введіть перше число');
// let y = +prompt('Введіть друге число');
// if (x>y) {
//     console.log(x)
// }
// else if (y>x) {
//     console.log(y)
// }
// else if (x===y) {
//     console.log('Ви двічі ввели число:', x)
// }

// - У першому під'їзді квартири з 1 до 20. У другому з 21 по 48. У третьому з 49 по 90.
// Користувач вводить номер квартири просто в змінні або через prompt('') . Програма повинна зазначити, в якому під'їзді знаходиться дана квартира.

// let number = +prompt('Введіть номер квартири');
// if (number >=1 && number <=20) {
//     console.log('Квартира знаходиться у першому під’їзді')
// }
// else if (number >=21 && number <=48) {
//     console.log('Квартира знаходиться у другому під’їзді')
// }
// else if (number >=49 && number <=90) {
//     console.log('Квартира знаходиться у третьому під’їзді')
// }
// else (console.log('Вводьте номер в діапазоні 1-90'))

// - Ми маємо змінну number в яку користувач задає числове значення,  якщо змінна рівна 10 вивести повідомлення ВІРНО, якщо змінна не рівна 10 - тоді НЕВІРНО

// let number = +prompt('Введіть число');
// if (number === 10) {
//     console.log('Вірно')
// }
// else {
//     console.log('Не вірно')
// }

// - Ми маємо змінну x в яку користувач задає  значення,  якщо в змінну записане число, вивести 1,
//     якщо в змінну записали стрінгу вивести 2, якщо булеве значення - 3, якщо об'єкт або масив - 4.
// якщо в змінну записали щось інше, спрацьовує else

// let x = {name: "Gosha"};
// if (typeof x === 'number') {
//     console.log('1')
// } else if (typeof x === "string") {
//     console.log('2')
// } else if (typeof x === "boolean") {
//     console.log('3')
// } else if (typeof x === "object") {
//     console.log('4')
// } else {
//     console.log('?')
// }

